In [2]:
import pandas as pd

In [3]:
forum_users = {
    'User ID': [1,2,3,4,5],
    'Username': ['bob_s','jane_smith','alex123','bob56','mark'],
    'Age': [18,35,25,38,None],
    'Joined Date': ['2023-01-01','2023-01-01','2023-05-01','2023-04-11','2023-12-31',],
    'Total Posts': [150,230,80,420,310],
    'Reputation': [500,720,200,940,500]
}
df = pd.DataFrame(forum_users)
df

   User ID    Username   Age Joined Date  Total Posts  Reputation
0        1       bob_s  18.0  2023-01-01          150         500
1        2  jane_smith  35.0  2023-01-01          230         720
2        3     alex123  25.0  2023-05-01           80         200
3        4       bob56  38.0  2023-04-11          420         940
4        5        mark   NaN  2023-12-31          310         500

In [6]:
# Нужные столбцы 
df[['Username', 'Age']]

     Username   Age
0       bob_s  18.0
1  jane_smith  35.0
2     alex123  25.0
3       bob56  38.0
4        mark   NaN

In [7]:
# Выборка определенного ряда
df.loc[3]

User ID                 4
Username            bob56
Age                  38.0
Joined Date    2023-04-11
Total Posts           420
Reputation            940
Name: 3, dtype: object

In [8]:
#Находим ряд с меткой 2 и 3
df.loc[2:3]

   User ID Username   Age Joined Date  Total Posts  Reputation
2        3  alex123  25.0  2023-05-01           80         200
3        4    bob56  38.0  2023-04-11          420         940

In [9]:
df.loc[2:3,['Username','Joined Date', 'Reputation']]

  Username Joined Date  Reputation
2  alex123  2023-05-01         200
3    bob56  2023-04-11         940